leetcode/leetcode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>LeetCode笔记</title>
<!-- 2015-06-02 二 17:11 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="马楠（nxmanan#gmail.com）" />
<meta  name="description" content="LeetCode笔记"
 />
<meta  name="keywords" content="Algorithm" />
<link rel="stylesheet" type="text/css" href="../style/emacs.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./leetcode.html"> UP </a>
 |
 <a accesskey="H" href="http://wiki.manan.org"> HOME </a>
</div><div id="content">
<h1 class="title">LeetCode笔记</h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">No.</th>
<th scope="col" class="left">Title</th>
<th scope="col" class="left">Note</th>
<th scope="col" class="right">Date</th>
<th scope="col" class="left">Difficulty</th>
<th scope="col" class="left">Data Structure</th>
<th scope="col" class="left">Algorithm</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left"><a href="https://oj.leetcode.com/problems/two-sum/">Two Sum</a></td>
<td class="left"><a href="./two-sum.html">HTML</a></td>
<td class="right">2014-12-12</td>
<td class="left">Medium</td>
<td class="left">Array, Hash table</td>
<td class="left">Sort</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left"><a href="https://leetcode.com/problems/add-two-numbers/">Add Two Numbers</a></td>
<td class="left"><a href="./add-two-numbers.html">HTML</a></td>
<td class="right">2015-04-02</td>
<td class="left">Easy</td>
<td class="left">Linked list</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left"><a href="https://leetcode.com/problems/longest-substring-without-repeating-characters/">Longest Substring</a></td>
<td class="left"><a href="./https://leetcode.com/problems/longest-substring-without-repeating-characters/">HTML</a></td>
<td class="right">2015-04-02</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">Greedy Algorithm</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left"><a href="https://leetcode.com/problems/median-of-two-sorted-arrays/">Median of Two Sorted Arrays</a></td>
<td class="left"><a href="./median-of-two-sorted-arrays.html">HTML</a></td>
<td class="right">2015-04-02</td>
<td class="left">Hard</td>
<td class="left">Array</td>
<td class="left">Binary sort</td>
</tr>

<tr>
<td class="right">5</td>
<td class="left"><a href="https://leetcode.com/problems/longest-palindromic-substring/">Longest Palindromic Substring</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-04-03</td>
<td class="left">Medium</td>
<td class="left">String</td>
<td class="left">DP</td>
</tr>

<tr>
<td class="right">6</td>
<td class="left"><a href="https://leetcode.com/problems/zigzag-conversion/">ZigZag Conversion</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-04-07</td>
<td class="left">Easy</td>
<td class="left">String</td>
<td class="left">规律</td>
</tr>

<tr>
<td class="right">7</td>
<td class="left"><a href="https://leetcode.com/problems/reverse-integer/">Reverse Integer</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-04-07</td>
<td class="left">Easy</td>
<td class="left">&#xa0;</td>
<td class="left">溢出判断</td>
</tr>

<tr>
<td class="right">8</td>
<td class="left"><a href="https://leetcode.com/problems/string-to-integer-atoi/">String to Integer</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-04-07</td>
<td class="left">Easy</td>
<td class="left">String</td>
<td class="left">多种输入</td>
</tr>

<tr>
<td class="right">9</td>
<td class="left"><a href="https://leetcode.com/problems/palindrome-number/">Palindrome Number</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-04-08</td>
<td class="left">Easy</td>
<td class="left">Number</td>
<td class="left">模运算</td>
</tr>

<tr>
<td class="right">10</td>
<td class="left"><a href="https://leetcode.com/problems/regular-expression-matching/">Regular Expression Matching</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-04-08</td>
<td class="left">Hard</td>
<td class="left">String</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">11</td>
<td class="left"><a href="https://leetcode.com/problems/container-with-most-water/">Container With Most Water</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-04-09</td>
<td class="left">Medium</td>
<td class="left">&#xa0;</td>
<td class="left">贪心？</td>
</tr>

<tr>
<td class="right">12</td>
<td class="left"><a href="https://leetcode.com/problems/integer-to-roman/">Integer to Roman</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-04-13</td>
<td class="left">Medium</td>
<td class="left">String, Array</td>
<td class="left">规律</td>
</tr>

<tr>
<td class="right">13</td>
<td class="left"><a href="https://leetcode.com/problems/roman-to-integer/">Roman to Integer</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-04-13</td>
<td class="left">Easy</td>
<td class="left">String, Array</td>
<td class="left">规律</td>
</tr>

<tr>
<td class="right">14</td>
<td class="left"><a href="https://leetcode.com/problems/longest-common-prefix/">Longest Common Prefix</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-04-13</td>
<td class="left">Easy</td>
<td class="left">String, Array</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">15</td>
<td class="left"><a href="https://oj.leetcode.com/problems/3sum/">3Sum</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-04-14</td>
<td class="left">Medium</td>
<td class="left">Vector</td>
<td class="left">二分查找，排序</td>
</tr>

<tr>
<td class="right">16</td>
<td class="left"><a href="https://leetcode.com/problems/3sum-closest/">3Sum Closest</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-04-14</td>
<td class="left">Medium</td>
<td class="left">Vector, Array</td>
<td class="left">排序</td>
</tr>

<tr>
<td class="right">17</td>
<td class="left"><a href="https://leetcode.com/problems/letter-combinations-of-a-phone-number/">Letter Combinations of a Phone</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-04-14</td>
<td class="left">Medium</td>
<td class="left">Vector</td>
<td class="left">递归</td>
</tr>

<tr>
<td class="right">18</td>
<td class="left"><a href="https://leetcode.com/problems/4sum/">4Sum</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-04-15</td>
<td class="left">Medium</td>
<td class="left">Vector, Array</td>
<td class="left">排序，双指针移动</td>
</tr>

<tr>
<td class="right">19</td>
<td class="left"><a href="https://leetcode.com/problems/remove-nth-node-from-end-of-list/">Remove Nth Node</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-04-15</td>
<td class="left">Easy</td>
<td class="left">Linked List</td>
<td class="left">快慢指针</td>
</tr>

<tr>
<td class="right">20</td>
<td class="left"><a href="https://leetcode.com/problems/valid-parentheses/">Valid Parentheses</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-04-15</td>
<td class="left">Easy</td>
<td class="left">Stack, String</td>
<td class="left">栈</td>
</tr>

<tr>
<td class="right">21</td>
<td class="left"><a href="https://leetcode.com/problems/merge-two-sorted-lists/">Merge Two Sorted Lists</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-04-16</td>
<td class="left">Easy</td>
<td class="left">Linked List</td>
<td class="left">归并</td>
</tr>

<tr>
<td class="right">22</td>
<td class="left"><a href="https://leetcode.com/problems/generate-parentheses/">Generate Parentheses</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-04-17</td>
<td class="left">Medium</td>
<td class="left">Vector, String</td>
<td class="left">递归</td>
</tr>

<tr>
<td class="right">23</td>
<td class="left"><a href="https://leetcode.com/problems/merge-k-sorted-lists/">Merge k Sorted Lists</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-04-17</td>
<td class="left">Hard</td>
<td class="left">Linked List</td>
<td class="left">归并，优化</td>
</tr>

<tr>
<td class="right">24</td>
<td class="left"><a href="https://leetcode.com/problems/swap-nodes-in-pairs/">Swap Nodes in Pairs</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-04-17</td>
<td class="left">Medium</td>
<td class="left">Linked List</td>
<td class="left">循环</td>
</tr>

<tr>
<td class="right">25</td>
<td class="left"><a href="https://leetcode.com/problems/reverse-nodes-in-k-group/">Reverse Nodes in k-Group</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-05</td>
<td class="left">Hard</td>
<td class="left">Linked List</td>
<td class="left">递归，细节</td>
</tr>

<tr>
<td class="right">26</td>
<td class="left"><a href="https://leetcode.com/problems/remove-duplicates-from-sorted-array/">RemoveDuplicatesfromSortedArray</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-05</td>
<td class="left">Easy</td>
<td class="left">Array</td>
<td class="left">技巧</td>
</tr>

<tr>
<td class="right">27</td>
<td class="left"><a href="https://leetcode.com/problems/remove-element/">Remove Element</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-05</td>
<td class="left">Easy</td>
<td class="left">Array</td>
<td class="left">技巧</td>
</tr>

<tr>
<td class="right">28</td>
<td class="left"><a href="https://leetcode.com/problems/implement-strstr/">Implement strStr</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-05</td>
<td class="left">Easy</td>
<td class="left">String</td>
<td class="left">暴力</td>
</tr>

<tr>
<td class="right">29</td>
<td class="left"><a href="https://leetcode.com/problems/divide-two-integers/">Divide Two Integers</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-05</td>
<td class="left">Medium</td>
<td class="left">Number</td>
<td class="left">位操作</td>
</tr>

<tr>
<td class="right">30</td>
<td class="left"><a href="https://leetcode.com/problems/substring-with-concatenation-of-all-words/">Substring with Concatenation</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-06</td>
<td class="left">Hard</td>
<td class="left">String, Map</td>
<td class="left">技巧，细节</td>
</tr>

<tr>
<td class="right">31</td>
<td class="left"><a href="https://leetcode.com/problems/next-permutation/">Next Permutation</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-06</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">技巧</td>
</tr>

<tr>
<td class="right">32</td>
<td class="left"><a href="https://leetcode.com/problems/longest-valid-parentheses/">Longest Valid Parentheses</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-06</td>
<td class="left">Hard</td>
<td class="left">String, Stack</td>
<td class="left">规律</td>
</tr>

<tr>
<td class="right">33</td>
<td class="left"><a href="https://leetcode.com/problems/search-in-rotated-sorted-array/">Search in Rotated Sorted Array</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-06</td>
<td class="left">Hard</td>
<td class="left">Array</td>
<td class="left">二分查找</td>
</tr>

<tr>
<td class="right">34</td>
<td class="left"><a href="https://leetcode.com/problems/search-for-a-range/">Search for a Range</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-06</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">二分查找</td>
</tr>

<tr>
<td class="right">35</td>
<td class="left"><a href="https://leetcode.com/problems/search-insert-position/">Search Insert Position</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-06</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">二分查找</td>
</tr>

<tr>
<td class="right">36</td>
<td class="left"><a href="https://leetcode.com/problems/valid-sudoku/">Valid Sudoku</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-06</td>
<td class="left">Easy</td>
<td class="left">Array</td>
<td class="left">细节</td>
</tr>

<tr>
<td class="right">37</td>
<td class="left"><a href="https://leetcode.com/problems/sudoku-solver/">Sudoku Solver</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-07</td>
<td class="left">Hard</td>
<td class="left">Array</td>
<td class="left">DFS，类似8皇后</td>
</tr>

<tr>
<td class="right">38</td>
<td class="left"><a href="https://leetcode.com/problems/count-and-say/">Count and Say</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-07</td>
<td class="left">Easy</td>
<td class="left">String</td>
<td class="left">细节</td>
</tr>

<tr>
<td class="right">39</td>
<td class="left"><a href="https://leetcode.com/problems/combination-sum/">Combination Sum</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-07</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">DFS，剪枝</td>
</tr>

<tr>
<td class="right">40</td>
<td class="left"><a href="https://leetcode.com/problems/combination-sum-ii/">Combination Sum II</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-07</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">类似39，消重</td>
</tr>

<tr>
<td class="right">41</td>
<td class="left"><a href="https://leetcode.com/problems/first-missing-positive/">First Missing Positive</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-08</td>
<td class="left">Hard</td>
<td class="left">Array</td>
<td class="left">swap</td>
</tr>

<tr>
<td class="right">42</td>
<td class="left"><a href="https://leetcode.com/problems/trapping-rain-water/">Trapping Rain Water</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-08</td>
<td class="left">Hard</td>
<td class="left">Array</td>
<td class="left">规律</td>
</tr>

<tr>
<td class="right">43</td>
<td class="left"><a href="https://leetcode.com/problems/multiply-strings/">Multiply Strings</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-08</td>
<td class="left">Medium</td>
<td class="left">String, Array</td>
<td class="left">细节实现，大整数</td>
</tr>

<tr>
<td class="right">44</td>
<td class="left"><a href="https://leetcode.com/problems/wildcard-matching/">Wildcard Matching</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-08</td>
<td class="left">Hard</td>
<td class="left">String</td>
<td class="left">正则匹配</td>
</tr>

<tr>
<td class="right">45</td>
<td class="left"><a href="https://leetcode.com/problems/jump-game-ii/">Jump Game II</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-12</td>
<td class="left">Hard</td>
<td class="left">Array</td>
<td class="left">贪心法</td>
</tr>

<tr>
<td class="right">46</td>
<td class="left"><a href="https://leetcode.com/problems/permutations/">Permutations</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-12</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">递归</td>
</tr>

<tr>
<td class="right">47</td>
<td class="left"><a href="https://leetcode.com/problems/permutations-ii/">Permutations II</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-12</td>
<td class="left">Hard</td>
<td class="left">Array</td>
<td class="left">递归，技巧</td>
</tr>

<tr>
<td class="right">48</td>
<td class="left"><a href="https://leetcode.com/problems/rotate-image/">Rotate Image</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-12</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">模拟；规律</td>
</tr>

<tr>
<td class="right">49</td>
<td class="left"><a href="https://leetcode.com/problems/anagrams/">Anagrams</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-12</td>
<td class="left">Medium</td>
<td class="left">String, Map</td>
<td class="left">细节</td>
</tr>

<tr>
<td class="right">50</td>
<td class="left"><a href="https://leetcode.com/problems/powx-n/">Pow(x, n)</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-12</td>
<td class="left">Medium</td>
<td class="left">Number</td>
<td class="left">分治，递归/非递归</td>
</tr>

<tr>
<td class="right">51</td>
<td class="left"><a href="https://leetcode.com/problems/n-queens/">N-Queens</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-12</td>
<td class="left">Hard</td>
<td class="left">Array</td>
<td class="left">dfs, 递归</td>
</tr>

<tr>
<td class="right">52</td>
<td class="left"><a href="https://leetcode.com/problems/n-queens-ii/">N-Queens II</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-12</td>
<td class="left">Hard</td>
<td class="left">Array</td>
<td class="left">dfs, 递归</td>
</tr>

<tr>
<td class="right">53</td>
<td class="left"><a href="https://leetcode.com/problems/maximum-subarray/">Maximum Subarray</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-13</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">dp</td>
</tr>

<tr>
<td class="right">54</td>
<td class="left"><a href="https://leetcode.com/problems/spiral-matrix/">Spiral Matrix</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-13</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">细节</td>
</tr>

<tr>
<td class="right">55</td>
<td class="left"><a href="https://leetcode.com/problems/jump-game/">Jump Game</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-13</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">贪心，dp</td>
</tr>

<tr>
<td class="right">56</td>
<td class="left"><a href="https://leetcode.com/problems/merge-intervals/">Merge Intervals</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-13</td>
<td class="left">Hard</td>
<td class="left">Array</td>
<td class="left">细节</td>
</tr>

<tr>
<td class="right">57</td>
<td class="left"><a href="https://leetcode.com/problems/insert-interval/">Insert Interval</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-13</td>
<td class="left">Hard</td>
<td class="left">Array</td>
<td class="left">细节，排序</td>
</tr>

<tr>
<td class="right">58</td>
<td class="left"><a href="https://leetcode.com/problems/length-of-last-word/">Length of Last Word</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-13</td>
<td class="left">Easy</td>
<td class="left">String</td>
<td class="left">细节</td>
</tr>

<tr>
<td class="right">59</td>
<td class="left"><a href="https://leetcode.com/problems/spiral-matrix-ii/">Spiral Matrix II</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-13</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">细节</td>
</tr>

<tr>
<td class="right">60</td>
<td class="left"><a href="https://leetcode.com/problems/permutation-sequence/">Permutation Sequence</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-13</td>
<td class="left">Medium</td>
<td class="left">String</td>
<td class="left">规律，细节</td>
</tr>

<tr>
<td class="right">61</td>
<td class="left"><a href="https://leetcode.com/problems/rotate-list/">Rotate List</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-13</td>
<td class="left">Medium</td>
<td class="left">Linked List</td>
<td class="left">细节</td>
</tr>

<tr>
<td class="right">62</td>
<td class="left"><a href="https://leetcode.com/problems/unique-paths/">Unique Paths</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-13</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">dp</td>
</tr>

<tr>
<td class="right">63</td>
<td class="left"><a href="https://leetcode.com/problems/unique-paths-ii/">Unique Paths II</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-13</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">dp</td>
</tr>

<tr>
<td class="right">64</td>
<td class="left"><a href="https://leetcode.com/problems/minimum-path-sum/">Minimum Path Sum</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-13</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">dp</td>
</tr>

<tr>
<td class="right">65</td>
<td class="left"><a href="https://leetcode.com/problems/valid-number/">Valid Number</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-14</td>
<td class="left">Hard</td>
<td class="left">String</td>
<td class="left">字符串，细节</td>
</tr>

<tr>
<td class="right">66</td>
<td class="left"><a href="https://leetcode.com/problems/plus-one/">Plus One</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-14</td>
<td class="left">Easy</td>
<td class="left">Array</td>
<td class="left">细节</td>
</tr>

<tr>
<td class="right">67</td>
<td class="left"><a href="https://leetcode.com/problems/add-binary/">Add Binary</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-14</td>
<td class="left">Easy</td>
<td class="left">String</td>
<td class="left">细节</td>
</tr>

<tr>
<td class="right">68</td>
<td class="left"><a href="https://leetcode.com/problems/text-justification/">Text Justification</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-14</td>
<td class="left">Hard</td>
<td class="left">String</td>
<td class="left">字符串，细节</td>
</tr>

<tr>
<td class="right">69</td>
<td class="left"><a href="https://leetcode.com/problems/sqrtx/">Sqrt(x)</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-14</td>
<td class="left">Medium</td>
<td class="left">Number</td>
<td class="left">二分，细节</td>
</tr>

<tr>
<td class="right">70</td>
<td class="left"><a href="https://leetcode.com/problems/climbing-stairs/">Climbing Stairs</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-14</td>
<td class="left">Easy</td>
<td class="left">Array</td>
<td class="left">规律</td>
</tr>

<tr>
<td class="right">71</td>
<td class="left"><a href="https://leetcode.com/problems/simplify-path/">Simplify Path</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-14</td>
<td class="left">Medium</td>
<td class="left">String</td>
<td class="left">技巧</td>
</tr>

<tr>
<td class="right">72</td>
<td class="left"><a href="https://leetcode.com/problems/edit-distance/">Edit Distance</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-15</td>
<td class="left">Hard</td>
<td class="left">String</td>
<td class="left">dp</td>
</tr>

<tr>
<td class="right">73</td>
<td class="left"><a href="https://leetcode.com/problems/set-matrix-zeroes/">Set Matrix Zeroes</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-15</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">技巧</td>
</tr>

<tr>
<td class="right">74</td>
<td class="left"><a href="https://leetcode.com/problems/search-a-2d-matrix/">Search a 2D Matrix</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-15</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">二分查找</td>
</tr>

<tr>
<td class="right">75</td>
<td class="left"><a href="https://leetcode.com/problems/sort-colors/">Sort Colors</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-15</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">技巧</td>
</tr>

<tr>
<td class="right">76</td>
<td class="left"><a href="https://leetcode.com/problems/minimum-window-substring/">Minimum Window Substring</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-18</td>
<td class="left">Hard</td>
<td class="left">String</td>
<td class="left">细节</td>
</tr>

<tr>
<td class="right">77</td>
<td class="left"><a href="https://leetcode.com/problems/combinations/">Combinations</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-18</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">技巧</td>
</tr>

<tr>
<td class="right">78</td>
<td class="left"><a href="https://leetcode.com/problems/subsets/">Subsets</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-18</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">技巧</td>
</tr>

<tr>
<td class="right">79</td>
<td class="left"><a href="https://leetcode.com/problems/word-search/">Word Search</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-18</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">dfs</td>
</tr>

<tr>
<td class="right">80</td>
<td class="left"><a href="https://leetcode.com/problems/remove-duplicates-from-sorted-array-ii/">RemoveDuplicatesfromSortedII</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-18</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">细节</td>
</tr>

<tr>
<td class="right">81</td>
<td class="left"><a href="https://leetcode.com/problems/search-in-rotated-sorted-array-ii/">Search in Rotated Sorted II</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-19</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">二分</td>
</tr>

<tr>
<td class="right">82</td>
<td class="left"><a href="https://leetcode.com/problems/remove-duplicates-from-sorted-list-ii/">Remove Duplicates from SortedII</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-19</td>
<td class="left">Medium</td>
<td class="left">Linked List</td>
<td class="left">细节</td>
</tr>

<tr>
<td class="right">83</td>
<td class="left"><a href="https://leetcode.com/problems/remove-duplicates-from-sorted-list/">Remove Duplicates from Sorted</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-19</td>
<td class="left">Easy</td>
<td class="left">Linked List</td>
<td class="left">细节</td>
</tr>

<tr>
<td class="right">84</td>
<td class="left"><a href="https://leetcode.com/problems/largest-rectangle-in-histogram/">Largest Rectangle</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-19</td>
<td class="left">Hard</td>
<td class="left">Array, Stack</td>
<td class="left">技巧</td>
</tr>

<tr>
<td class="right">85</td>
<td class="left"><a href="https://leetcode.com/problems/maximal-rectangle/">Maximal Rectangle </a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-19</td>
<td class="left">Hard</td>
<td class="left">Array</td>
<td class="left">机器/dp</td>
</tr>

<tr>
<td class="right">86</td>
<td class="left"><a href="https://leetcode.com/problems/partition-list/">Partition List</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-20</td>
<td class="left">Medium</td>
<td class="left">Linked List</td>
<td class="left">技巧</td>
</tr>

<tr>
<td class="right">87</td>
<td class="left"><a href="https://leetcode.com/problems/scramble-string/">Scramble String</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-20</td>
<td class="left">Hard</td>
<td class="left">String</td>
<td class="left">递归，剪枝/dp</td>
</tr>

<tr>
<td class="right">88</td>
<td class="left"><a href="https://leetcode.com/problems/merge-sorted-array/">Merge Sorted Array</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-20</td>
<td class="left">Easy</td>
<td class="left">Array</td>
<td class="left">技巧</td>
</tr>

<tr>
<td class="right">89</td>
<td class="left"><a href="https://leetcode.com/problems/gray-code/">Gray Code</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-20</td>
<td class="left">Medium</td>
<td class="left">Number</td>
<td class="left">技巧</td>
</tr>

<tr>
<td class="right">90</td>
<td class="left"><a href="https://leetcode.com/problems/subsets-ii/">Subsets II</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-20</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">技巧</td>
</tr>

<tr>
<td class="right">91</td>
<td class="left"><a href="https://leetcode.com/problems/decode-ways/">Decode Ways</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-20</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">dp</td>
</tr>

<tr>
<td class="right">92</td>
<td class="left"><a href="https://leetcode.com/problems/reverse-linked-list-ii/">Reverse Linked List II</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-21</td>
<td class="left">Medium</td>
<td class="left">Linked List</td>
<td class="left">细节</td>
</tr>

<tr>
<td class="right">93</td>
<td class="left"><a href="https://leetcode.com/problems/restore-ip-addresses/">Restore IP Addresses</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-21</td>
<td class="left">Medium</td>
<td class="left">String</td>
<td class="left">dfs</td>
</tr>

<tr>
<td class="right">94</td>
<td class="left"><a href="https://leetcode.com/problems/binary-tree-inorder-traversal/">Binary Tree Inorder Traversal</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-21</td>
<td class="left">Medium</td>
<td class="left">Tree</td>
<td class="left">细节</td>
</tr>

<tr>
<td class="right">95</td>
<td class="left"><a href="https://leetcode.com/problems/unique-binary-search-trees-ii/">Unique Binary Search Trees II</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-21</td>
<td class="left">Medium</td>
<td class="left">Tree</td>
<td class="left">递归/规律</td>
</tr>

<tr>
<td class="right">96</td>
<td class="left"><a href="https://leetcode.com/problems/unique-binary-search-trees/">Unique Binary Search Trees</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-21</td>
<td class="left">Medium</td>
<td class="left">Tree</td>
<td class="left">dp/规律</td>
</tr>

<tr>
<td class="right">97</td>
<td class="left"><a href="https://leetcode.com/problems/interleaving-string/">Interleaving String</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-21</td>
<td class="left">Hard</td>
<td class="left">String</td>
<td class="left">dp</td>
</tr>

<tr>
<td class="right">98</td>
<td class="left"><a href="https://leetcode.com/problems/validate-binary-search-tree/">Validate Binary Search Tree</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-21</td>
<td class="left">Medium</td>
<td class="left">Tree</td>
<td class="left">递归</td>
</tr>

<tr>
<td class="right">99</td>
<td class="left"><a href="https://leetcode.com/problems/recover-binary-search-tree/">Recover Binary Search Tree</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-26</td>
<td class="left">Hard</td>
<td class="left">Tree</td>
<td class="left">技巧</td>
</tr>

<tr>
<td class="right">100</td>
<td class="left"><a href="https://leetcode.com/problems/same-tree/">Same Tree</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-26</td>
<td class="left">Easy</td>
<td class="left">Tree</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">101</td>
<td class="left"><a href="https://leetcode.com/problems/symmetric-tree/">Symmetric Tree</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-26</td>
<td class="left">Easy</td>
<td class="left">Tree</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">102</td>
<td class="left"><a href="https://leetcode.com/problems/binary-tree-level-order-traversal/">Binary Tree Level Order</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-26</td>
<td class="left">Easy</td>
<td class="left">Tree</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">103</td>
<td class="left"><a href="https://leetcode.com/problems/binary-tree-zigzag-level-order-traversal/">Binary Tree Zigzag</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-26</td>
<td class="left">Medium</td>
<td class="left">Tree</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">104</td>
<td class="left"><a href="https://leetcode.com/problems/maximum-depth-of-binary-tree/">Maximum Depth of Binary Tree</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-26</td>
<td class="left">Easy</td>
<td class="left">Tree</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">105</td>
<td class="left"><a href="https://leetcode.com/problems/construct-binary-tree-from-preorder-and-inorder-traversal/">Construct Binary Tree</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-26</td>
<td class="left">Medium</td>
<td class="left">Tree</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">106</td>
<td class="left"><a href="https://leetcode.com/problems/construct-binary-tree-from-inorder-and-postorder-traversal/">Construct Binary Tree</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-26</td>
<td class="left">Medium</td>
<td class="left">Tree</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">107</td>
<td class="left"><a href="https://leetcode.com/problems/binary-tree-level-order-traversal-ii/">Binary Tree Level Order II</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-26</td>
<td class="left">Easy</td>
<td class="left">Tree</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">108</td>
<td class="left"><a href="https://leetcode.com/problems/convert-sorted-array-to-binary-search-tree/">Convert Sorted Array</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-27</td>
<td class="left">Medium</td>
<td class="left">Tree</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">109</td>
<td class="left"><a href="https://leetcode.com/problems/convert-sorted-list-to-binary-search-tree/">Convert Sorted List</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-27</td>
<td class="left">Medium</td>
<td class="left">Tree</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">110</td>
<td class="left"><a href="https://leetcode.com/problems/balanced-binary-tree/">Balanced Binary Tree</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-27</td>
<td class="left">Easy</td>
<td class="left">Tree</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">111</td>
<td class="left"><a href="https://leetcode.com/problems/minimum-depth-of-binary-tree/">Minimum Depth of Binary Tree</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-27</td>
<td class="left">Easy</td>
<td class="left">Tree</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">112</td>
<td class="left"><a href="https://leetcode.com/problems/path-sum/">Path Sum</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-27</td>
<td class="left">Easy</td>
<td class="left">Tree</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">113</td>
<td class="left"><a href="https://leetcode.com/problems/path-sum-ii/">Path Sum II</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-27</td>
<td class="left">Medium</td>
<td class="left">Tree</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">114</td>
<td class="left"><a href="https://leetcode.com/problems/flatten-binary-tree-to-linked-list/">Flatten Binary Tree</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-27</td>
<td class="left">Medium</td>
<td class="left">Tree</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">115</td>
<td class="left"><a href="https://leetcode.com/problems/distinct-subsequences/">Distinct Subsequences</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-27</td>
<td class="left">Hard</td>
<td class="left">Array</td>
<td class="left">dp</td>
</tr>

<tr>
<td class="right">116</td>
<td class="left"><a href="https://leetcode.com/problems/populating-next-right-pointers-in-each-node/">Populating Next Right</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-27</td>
<td class="left">Medium</td>
<td class="left">Tree</td>
<td class="left">技巧</td>
</tr>

<tr>
<td class="right">117</td>
<td class="left"><a href="https://leetcode.com/problems/populating-next-right-pointers-in-each-node-ii/">Populating Next Right II</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-27</td>
<td class="left">Hard</td>
<td class="left">Tree</td>
<td class="left">技巧</td>
</tr>

<tr>
<td class="right">118</td>
<td class="left"><a href="https://leetcode.com/problems/pascals-triangle/">Pascal's Triangle</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-27</td>
<td class="left">Easy</td>
<td class="left">Array</td>
<td class="left">规律</td>
</tr>

<tr>
<td class="right">119</td>
<td class="left"><a href="https://leetcode.com/problems/pascals-triangle-ii/">Pascal's Triangle II</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-27</td>
<td class="left">Easy</td>
<td class="left">Array</td>
<td class="left">规律</td>
</tr>

<tr>
<td class="right">120</td>
<td class="left"><a href="https://leetcode.com/problems/triangle/">Triangle</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-27</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">dp</td>
</tr>

<tr>
<td class="right">121</td>
<td class="left"><a href="https://leetcode.com/problems/best-time-to-buy-and-sell-stock/">Stock I</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-27</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">贪心</td>
</tr>

<tr>
<td class="right">122</td>
<td class="left"><a href="https://leetcode.com/problems/best-time-to-buy-and-sell-stock-ii/">Stock II</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-27</td>
<td class="left">Medium</td>
<td class="left">Array</td>
<td class="left">贪心/规律</td>
</tr>

<tr>
<td class="right">123</td>
<td class="left"><a href="https://leetcode.com/problems/best-time-to-buy-and-sell-stock-iii/">Stock III</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-29</td>
<td class="left">Hard</td>
<td class="left">Array</td>
<td class="left">dp</td>
</tr>

<tr>
<td class="right">124</td>
<td class="left"><a href="https://leetcode.com/problems/binary-tree-maximum-path-sum/">Binary Tree Maximum Path Sum</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-29</td>
<td class="left">Hard</td>
<td class="left">Tree</td>
<td class="left">技巧</td>
</tr>

<tr>
<td class="right">125</td>
<td class="left"><a href="https://leetcode.com/problems/valid-palindrome/">Valid Palindrome</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-29</td>
<td class="left">Easy</td>
<td class="left">String</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">126</td>
<td class="left"><a href="https://leetcode.com/problems/word-ladder-ii/">Word Ladder II</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-29</td>
<td class="left">Hard</td>
<td class="left">String, Map</td>
<td class="left">dfs</td>
</tr>

<tr>
<td class="right">127</td>
<td class="left"><a href="https://leetcode.com/problems/word-ladder/">Word Ladder</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-29</td>
<td class="left">Medium</td>
<td class="left">String, Map</td>
<td class="left">细节，技巧</td>
</tr>

<tr>
<td class="right">128</td>
<td class="left"><a href="https://leetcode.com/problems/longest-consecutive-sequence/">Longest Consecutive Sequence</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-29</td>
<td class="left">Medium</td>
<td class="left">Map, Array</td>
<td class="left">技巧</td>
</tr>

<tr>
<td class="right">129</td>
<td class="left"><a href="https://leetcode.com/problems/sum-root-to-leaf-numbers/">Sum Root to Leaf Numbers</a></td>
<td class="left">&#xa0;</td>
<td class="right">2015-05-29</td>
<td class="left">Easy</td>
<td class="left">Tree</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">136</td>
<td class="left"><a href="https://oj.leetcode.com/problems/single-number/">Single Number</a></td>
<td class="left"><a href="./single-number.html">HTML</a></td>
<td class="right">2014-12-12</td>
<td class="left">Medium</td>
<td class="left">Bit, Hash table</td>
<td class="left">Bit</td>
</tr>
</tbody>
</table>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2014-12-12</p>
<p class="author">Author: 马楠（nxmanan#gmail.com）</p>
<p class="date">Created: 2015-06-02 二 17:11</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
